package com.example.Task.요구사항;

public class tasks {
    //*테스트 내용:
    //[JSON 기반 데이터를 활용한 모니터링 페이지 구현]
    //(1)필수 구현
    //-JSON 데이터를 테이블 형태로 렌더링
    //-테이블을 특정 필드로 정렬하는 기능 구현
    //-뷰 화면에서 필터 기능 구현
    //-검색 기능 구현 (결과 파일 다운로드 또는 결과 화면 표출)
    //-성능 최적화 (무한 스크롤, 가상 리스트, 페이징 중 택 1)


    //(2)선택 구현
    //-특정 level이 연속 N회 이상 등장 시 강조
    //-최근 1시간 내 error 레벨 로그만 필터링
    //-간단한 통계 패널 (레벨별 개수 등)
    //-대시보드 형태의 요약 컴포넌트


    //(3)테스트 결과 제출
    //-제출 방식: 결과 파일을 압축(zip)하여 이메일 첨부 파일로 전송
    //-수신 이메일 주소: eversafe-web-dev@everspin.co.kr
    //-이메일 제목: [웹 개발자 테스트 제출] 홍길동
    //-이메일 본문 내용에 포함할 항목:
    //-본인의 성함/테스트 진행 중 느낀 점, 개선 제안, 기술적인 고민 등 자유롭게 기술
    //-특이사항이 있을 경우 명시
}
